# Terraform environment at22
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Maybe further truncated see logs for complete plan output]
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_resource_group.auth will be created
  + resource "azurerm_resource_group" "auth" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "rgauth001at22"
      + tags     = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
    }

  # azurerm_user_assigned_identity.application_admin will be created
  + resource "azurerm_user_assigned_identity" "application_admin" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "miappadminauth001at22"
      + principal_id        = (known after apply)
      + resource_group_name = "rgauth001at22"
      + tenant_id           = (known after apply)
    }

  # module.app_configuration.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.app_configuration.azurerm_app_configuration.app_configuration will be created
  + resource "azurerm_app_configuration" "app_configuration" {
      + endpoint                   = (known after apply)
      + id                         = (known after apply)
      + local_auth_enabled         = false
      + location                   = "norwayeast"
      + name                       = "appconfaltinnauth001at22"
      + primary_read_key           = (known after apply)
      + primary_write_key          = (known after apply)
      + purge_protection_enabled   = false
      + resource_group_name        = "rgauth001at22"
      + secondary_read_key         = (known after apply)
      + secondary_write_key        = (known after apply)
      + sku                        = "standard"
      + soft_delete_retention_days = 7
      + tags                       = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
    }

  # module.app_configuration.azurerm_app_configuration_key.key["ApplicationInsights:ConnectionString"] will be created
  + resource "azurerm_app_configuration_key" "key" {
      + configuration_store_id = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "ApplicationInsights:ConnectionString"
      + label                  = "default"
      + locked                 = false
      + tags                   = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
      + type                   = "kv"
      + value                  = (sensitive value)
    }

  # module.app_configuration.azurerm_app_configuration_key.key["Postgres:Host"] will be created
  + resource "azurerm_app_configuration_key" "key" {
      + configuration_store_id = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "Postgres:Host"
      + label                  = "default"
      + locked                 = false
      + tags                   = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
      + type                   = "kv"
      + value                  = (known after apply)
    }

  # module.app_configuration.azurerm_app_configuration_key.key["Sentinel"] will be created
  + resource "azurerm_app_configuration_key" "key" {
      + configuration_store_id = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "Sentinel"
      + label                  = "default"
      + locked                 = false
      + tags                   = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
      + type                   = "kv"
      + value                  = (known after apply)
    }

  # module.app_configuration.azurerm_app_configuration_key.key["ServiceBus:Endpoint"] will be created
  + resource "azurerm_app_configuration_key" "key" {
      + configuration_store_id = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "ServiceBus:Endpoint"
      + label                  = "default"
      + locked                 = false
      + tags                   = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
      + type                   = "kv"
      + value                  = (known after apply)
    }

  # module.app_configuration.azurerm_role_assignment.rbac will be created
  + resource "azurerm_role_assignment" "rbac" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "App Configuration Data Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.application_gateway.data.azurerm_key_vault.cert will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "cert" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "kvaltinnauthcert001at22"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "rgcert001at22"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.application_gateway.data.azurerm_key_vault_certificate.cert will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_certificate" "cert" {
      + certificate_data                = (known after apply)
      + certificate_data_base64         = (known after apply)
      + certificate_policy              = (known after apply)
      + expires                         = (known after apply)
      + id                              = (known after apply)
      + key_vault_id                    = (known after apply)
      + name                            = "cert"
      + not_before                      = (known after apply)
      + resource_manager_id             = (known after apply)
      + resource_manager_versionless_id = (known after apply)
      + secret_id                       = (known after apply)
      + tags                            = (known after apply)
      + thumbprint                      = (known after apply)
      + version                         = (known after apply)
      + versionless_id                  = (known after apply)
      + versionless_secret_id           = (known after apply)
    }

  # module.application_gateway.data.azurerm_user_assigned_identity.cert will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "cert" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "micert001at22"
      + principal_id        = (known after apply)
      + resource_group_name = "rgcert001at22"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)
    }

  # module.application_gateway.azurerm_application_gateway.appgw will be created
  + resource "azurerm_application_gateway" "appgw" {
      + id                          = (known after apply)
      + location                    = "norwayeast"
      + name                        = "appgwauth001at22"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "rgauth001at22"
      + tags                        = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
      + zones                       = [
          + "1",
        ]

      + autoscale_configuration {
          + max_capacity = 10
          + min_capacity = 0
        }

      + backend_address_pool {
          + fqdns        = [
              + "accesspackages.api.auth.at22.altinn.cloud",
            ]
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "backend_address_pool_container_app_api_accesspackages"
        }
      + backend_address_pool {
          + fqdns        = [
              + "deployapi.api.auth.at22.altinn.cloud",
            ]
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "backend_address_pool_container_app_api_deployapi"
        }
      + backend_address_pool {
          + fqdns        = [
              + "index.auth.at22.altinn.cloud",
            ]
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "backend_address_pool_container_app_frontend_index"
        }
      + backend_address_pool {
          + fqdns        = [
              + "index.auth.at22.altinn.cloud",
            ]
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "backend_address_pool_container_app_index"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "backend_http_settings_container_app_api_accesspackages"
          + pick_host_name_from_backend_address = true
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "probe_container_app_api_accesspackages"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "backend_http_settings_container_app_api_deployapi"
          + pick_host_name_from_backend_address = true
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "probe_container_app_api_deployapi"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "backend_http_settings_container_app_frontend_index"
          + pick_host_name_from_backend_address = true
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "probe_container_app_frontend_index"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "backend_http_settings_container_app_index"
          + pick_host_name_from_backend_address = true
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "probe_container_app_index"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "container_app_frontend_ip"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = (known after apply)
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "container_app_frontend_port"
          + port = 443
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "gateway_subnet"
          + subnet_id = (known after apply)
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "container_app_frontend_ip"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "container_app_frontend_port"
          + host_name                      = "api.auth.at22.altinn.cloud"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "http_listener_container_app_api"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "ssl_certificate"
          + ssl_profile_id                 = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "container_app_frontend_ip"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "container_app_frontend_port"
          + host_name                      = "auth.at22.altinn.cloud"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "http_listener_container_app_frontend"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "ssl_certificate"
          + ssl_profile_id                 = (known after apply)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "probe_container_app_api_accesspackages"
          + path                                      = "/healthz"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3

          + match {
              + status_code = [
                  + "200",
                ]
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "probe_container_app_api_deployapi"
          + path                                      = "/healthz"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3

          + match {
              + status_code = [
                  + "200",
                ]
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "probe_container_app_frontend_index"
          + path                                      = "/healthz"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3

          + match {
              + status_code = [
                  + "200",
                ]
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "probe_container_app_index"
          + path                                      = "/"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3

          + match {
              + status_code = [
                  + "200",
                ]
            }
        }

      + request_routing_rule {
          + backend_address_pool_id   = (known after apply)
          + backend_http_settings_id  = (known after apply)
          + http_listener_id          = (known after apply)
          + http_listener_name        = "http_listener_container_app_api"
          + id                        = (known after apply)
          + name                      = "request_routing_rule_container_api"
          + priority                  = 1
          + redirect_configuration_id = (known after apply)
          + rewrite_rule_set_id       = (known after apply)
          + rule_type                 = "PathBasedRouting"
          + url_path_map_id           = (known after apply)
          + url_path_map_name         = "url_path_map_container_app_api"
        }
      + request_routing_rule {
          + backend_address_pool_id   = (known after apply)
          + backend_http_settings_id  = (known after apply)
          + http_listener_id          = (known after apply)
          + http_listener_name        = "http_listener_container_app_frontend"
          + id                        = (known after apply)
          + name                      = "request_routing_rule_container_frontend"
          + priority                  = 2
          + redirect_configuration_id = (known after apply)
          + rewrite_rule_set_id       = (known after apply)
          + rule_type                 = "PathBasedRouting"
          + url_path_map_id           = (known after apply)
          + url_path_map_name         = "url_path_map_container_app_frontend"
        }

      + sku {
          + name = "Standard_v2"
          + tier = "Standard_v2"
        }

      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + url_path_map {
          + default_backend_address_pool_id    = (known after apply)
          + default_backend_address_pool_name  = "backend_address_pool_container_app_index"
          + default_backend_http_settings_id   = (known after apply)
          + default_backend_http_settings_name = "backend_http_settings_container_app_index"
          + default_redirect_configuration_id  = (known after apply)
          + default_rewrite_rule_set_id        = (known after apply)
          + id                                 = (known after apply)
          + name                               = "url_path_map_container_app_api"

          + path_rule {
              + backend_address_pool_id    = (known after apply)
              + backend_address_pool_name  = "backend_address_pool_container_app_api_accesspackages"
              + backend_http_settings_id   = (known after apply)
              + backend_http_settings_name = "backend_http_settings_container_app_api_accesspackages"
              + id                         = (known after apply)
              + name                       = "path_rule_container_app_api_accesspackages"
              + paths                      = [
                  + "/accesspackages/*",
                  + "/accesspackages",
                ]
              + redirect_configuration_id  = (known after apply)
              + rewrite_rule_set_id        = (known after apply)
            }
          + path_rule {
              + backend_address_pool_id    = (known after apply)
              + backend_address_pool_name  = "backend_address_pool_container_app_api_deployapi"
              + backend_http_settings_id   = (known after apply)
              + backend_http_settings_name = "backend_http_settings_container_app_api_deployapi"
              + id                         = (known after apply)
              + name                       = "path_rule_container_app_api_deployapi"
              + paths                      = [
                  + "/deployapi/*",
                  + "/deployapi",
                ]
              + redirect_configuration_id  = (known after apply)
              + rewrite_rule_set_id        = (known after apply)
            }
        }
      + url_path_map {
          + default_backend_address_pool_id    = (known after apply)
          + default_backend_address_pool_name  = "backend_address_pool_container_app_index"
          + default_backend_http_settings_id   = (known after apply)
          + default_backend_http_settings_name = "backend_http_settings_container_app_index"
          + default_redirect_configuration_id  = (known after apply)
          + default_rewrite_rule_set_id        = (known after apply)
          + id                                 = (known after apply)
          + name                               = "url_path_map_container_app_frontend"

          + path_rule {
              + backend_address_pool_id    = (known after apply)
              + backend_address_pool_name  = "backend_address_pool_container_app_frontend_index"
              + backend_http_settings_id   = (known after apply)
              + backend_http_settings_name = "backend_http_settings_container_app_frontend_index"
              + id                         = (known after apply)
              + name                       = "path_rule_container_app_frontend_index"
              + paths                      = [
                  + "/*",
                ]
              + redirect_configuration_id  = (known after apply)
              + rewrite_rule_set_id        = (known after apply)
            }
        }
    }

  # module.application_gateway.azurerm_monitor_diagnostic_setting.diagnostics will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostics" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "log_analytics_workspace"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category_group = "allLogs"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.application_gateway.azurerm_public_ip.ingress will be created
  + resource "azurerm_public_ip" "ingress" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "norwayeast"
      + name                    = "pipingressauth001at22"
      + resource_group_name     = "rgauth001at22"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + zones                   = [
          + "1",
        ]
    }

  # module.application_insights.azurerm_application_insights.ai will be created
  + resource "azurerm_application_insights" "ai" {
      + app_id                              = (known after apply)
      + application_type                    = "web"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "norwayeast"
      + name                                = "aiauth001at22"
      + resource_group_name                 = "rgauth001at22"
      + retention_in_days                   = 90
      + sampling_percentage                 = 100
      + tags                                = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
    }

  # module.application_insights.azurerm_log_analytics_workspace.log will be created
  + resource "azurerm_log_analytics_workspace" "log" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "norwayeast"
      + name                            = "logauth001at22"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rgauth001at22"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
      + workspace_id                    = (known after apply)
    }

  # module.container_app_environment.azurerm_container_app_environment.environment will be created
  + resource "azurerm_container_app_environment" "environment" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + infrastructure_subnet_id         = (known after apply)
      + internal_load_balancer_enabled   = true
      + location                         = "norwayeast"
      + log_analytics_workspace_id       = (known after apply)
      + mutual_tls_enabled               = false
      + name                             = "caenvauth001at22"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "rgauth001at22"
      + static_ip_address                = (known after apply)
      + tags                             = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
      + zone_redundancy_enabled          = true

      + workload_profile {
          + maximum_count         = 5
          + minimum_count         = 1
          + name                  = "basic"
          + workload_profile_type = "D4"
        }
    }

  # module.container_app_environment.azurerm_private_dns_a_record.asterisk["api"] will be created
  + resource "azurerm_private_dns_a_record" "asterisk" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "*"
      + records             = (known after apply)
      + resource_group_name = "rgauth001at22"
      + tags                = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
      + ttl                 = 300
      + zone_name           = "api.auth.at22.altinn.cloud"
    }

  # module.container_app_environment.azurerm_private_dns_a_record.asterisk["frontend"] will be created
  + resource "azurerm_private_dns_a_record" "asterisk" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "*"
      + records             = (known after apply)
      + resource_group_name = "rgauth001at22"
      + tags                = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
      + ttl                 = 300
      + zone_name           = "auth.at22.altinn.cloud"
    }

  # module.dns.azurerm_private_dns_zone.dns["api"] will be created
  + resource "azurerm_private_dns_zone" "dns" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "api.auth.at22.altinn.cloud"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rgauth001at22"
      + tags                                                  = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
    }

  # module.dns.azurerm_private_dns_zone.dns["app_configuration"] will be created
  + resource "azurerm_private_dns_zone" "dns" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.azconfig.io"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rgauth001at22"
      + tags                                                  = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
    }

  # module.dns.azurerm_private_dns_zone.dns["frontend"] will be created
  + resource "azurerm_private_dns_zone" "dns" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "auth.at22.altinn.cloud"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rgauth001at22"
      + tags                                                  = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
    }

  # module.dns.azurerm_private_dns_zone.dns["key_vault"] will be created
  + resource "azurerm_private_dns_zone" "dns" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.vaultcore.azure.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rgauth001at22"
      + tags                                                  = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
    }

  # module.dns.azurerm_private_dns_zone.dns["postgres"] will be created
  + resource "azurerm_private_dns_zone" "dns" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.postgres.database.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rgauth001at22"
      + tags                                                  = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
    }

  # module.dns.azurerm_private_dns_zone.dns["service_bus"] will be created
  + resource "azurerm_private_dns_zone" "dns" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.servicebus.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rgauth001at22"
      + tags                                                  = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
    }

  # module.dns.azurerm_private_dns_zone.dns["storage_account_blob"] will be created
  + resource "azurerm_private_dns_zone" "dns" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.blob.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rgauth001at22"
      + tags                                                  = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.dns["api"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "dns" {
      + id                    = (known after apply)
      + name                  = "api"
      + private_dns_zone_name = "api.auth.at22.altinn.cloud"
      + registration_enabled  = false
      + resource_group_name   = "rgauth001at22"
      + tags                  = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.dns["app_configuration"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "dns" {
      + id                    = (known after apply)
      + name                  = "app_configuration"
      + private_dns_zone_name = "privatelink.azconfig.io"
      + registration_enabled  = false
      + resource_group_name   = "rgauth001at22"
      + tags                  = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.dns["frontend"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "dns" {
      + id                    = (known after apply)
      + name                  = "frontend"
      + private_dns_zone_name = "auth.at22.altinn.cloud"
      + registration_enabled  = false
      + resource_group_name   = "rgauth001at22"
      + tags                  = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.dns["key_vault"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "dns" {
      + id                    = (known after apply)
      + name                  = "key_vault"
      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "rgauth001at22"
      + tags                  = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.dns["postgres"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "dns" {
      + id                    = (known after apply)
      + name                  = "postgres"
      + private_dns_zone_name = "privatelink.postgres.database.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "rgauth001at22"
      + tags                  = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.dns["service_bus"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "dns" {
      + id                    = (known after apply)
      + name                  = "service_bus"
      + private_dns_zone_name = "privatelink.servicebus.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "rgauth001at22"
      + tags                  = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.dns["storage_account_blob"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "dns" {
      + id                    = (known after apply)
      + name                  = "storage_account_blob"
      + private_dns_zone_name = "privatelink.blob.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "rgauth001at22"
      + tags                  = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.key_vault.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.key_vault.azurerm_key_vault.key_vault will be created
  + resource "azurerm_key_vault" "key_vault" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "kvaltinnauth001at22"
      + public_network_access_enabled = false
      + purge_protection_enabled      = true
      + resource_group_name           = "rgauth001at22"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 30
      + tags                          = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
      + tenant_id                     = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.key_vault.azurerm_private_endpoint.key_vault will be created
  + resource "azurerm_private_endpoint" "key_vault" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "nickvaltinnauth001at22"
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "pekvaltinnauth001at22"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "rgauth001at22"
      + subnet_id                     = (known after apply)
      + tags                          = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "kvaltinnauth001at22"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "kvaltinnauth001at22"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # module.key_vault.azurerm_role_assignment.key_vault_administrator["app"] will be created
  + resource "azurerm_role_assignment" "key_vault_administrator" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault.azurerm_role_assignment.key_vault_administrator["current"] will be created
  + resource "azurerm_role_assignment" "key_vault_administrator" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.nat.azurerm_nat_gateway.nat_gateway will be created
  + resource "azurerm_nat_gateway" "nat_gateway" {
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + location                = "norwayeast"
      + name                    = "natgwauth001at22"
      + resource_group_name     = "rgauth001at22"
      + resource_guid           = (known after apply)
      + sku_name                = "Standard"
      + tags                    = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
    }

  # module.nat.azurerm_nat_gateway_public_ip_association.nat_gateway will be created
  + resource "azurerm_nat_gateway_public_ip_association" "nat_gateway" {
      + id                   = (known after apply)
      + nat_gateway_id       = (known after apply)
      + public_ip_address_id = (known after apply)
    }

  # module.nat.azurerm_public_ip.nat_gateway will be created
  + resource "azurerm_public_ip" "nat_gateway" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "norwayeast"
      + name                    = "pipegressauth001at22"
      + resource_group_name     = "rgauth001at22"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
    }

  # module.nat.azurerm_subnet_nat_gateway_association.nat_gateway["container_apps"] will be created
  + resource "azurerm_subnet_nat_gateway_association" "nat_gateway" {
      + id             = (known after apply)
      + nat_gateway_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.nat.azurerm_subnet_nat_gateway_association.nat_gateway["default"] will be created
  + resource "azurerm_subnet_nat_gateway_association" "nat_gateway" {
      + id             = (known after apply)
      + nat_gateway_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.nat.azurerm_subnet_nat_gateway_association.nat_gateway["postgres"] will be created
  + resource "azurerm_subnet_nat_gateway_association" "nat_gateway" {
      + id             = (known after apply)
      + nat_gateway_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.postgres_server.azurerm_postgresql_flexible_server.postgres_server will be created
  + resource "azurerm_postgresql_flexible_server" "postgres_server" {
      + administrator_login           = (known after apply)
      + auto_grow_enabled             = true
      + backup_retention_days         = (known after apply)
      + delegated_subnet_id           = (known after apply)
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "psqlsrvaltinnauth001at22"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = false
      + resource_group_name           = "rgauth001at22"
      + sku_name                      = "B_Standard_B2ms"
      + storage_mb                    = 32768
      + storage_tier                  = (known after apply)
      + tags                          = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }
      + version                       = "16"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = false
          + tenant_id                     = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
        }
    }

  # module.postgres_server.azurerm_postgresql_flexible_server_active_directory_administrator.admin["miappadminauth001at22"] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "admin" {
      + id                  = (known after apply)
      + object_id           = (known after apply)
      + principal_name      = "miappadminauth001at22"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "rgauth001at22"
      + server_name         = "psqlsrvaltinnauth001at22"
      + tenant_id           = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
    }

  # module.service_bus.azurerm_role_definition.service_bus_masstransit will be created
  + resource "azurerm_role_definition" "service_bus_masstransit" {
      + assignable_scopes           = (known after apply)
      + description                 = "Allow C# Applications use MassTransit with Azure Service Bus"
      + id                          = (known after apply)
      + name                        = "Azure Service Bus Mass Transit"
      + role_definition_id          = (known after apply)
      + role_definition_resource_id = (known after apply)
      + scope                       = (known after apply)

      + permissions {
          + actions = [
              + "Microsoft.ServiceBus/namespaces/read",
              + "Microsoft.ServiceBus/namespaces/queues/*",
              + "Microsoft.ServiceBus/namespaces/topics/*",
            ]
        }
    }

  # module.service_bus.azurerm_servicebus_namespace.service_bus will be created
  + resource "azurerm_servicebus_namespace" "service_bus" {
      + capacity                            = 0
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + local_auth_enabled                  = true
      + location                            = "norwayeast"
      + minimum_tls_version                 = "1.2"
      + name                                = "sbaltinnauth001at22"
      + premium_messaging_partitions        = 0
      + public_network_access_enabled       = true
      + resource_group_name                 = "rgauth001at22"
      + sku                                 = "Standard"
      + tags                                = {
          + "environment" = "at22"
          + "instance"    = "001"
          + "name"        = "auth"
          + "repository"  = "github.com/altinn/altinn-authorization"
          + "suffix"      = "auth001at22"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_rule_set {
          + default_action                = "Deny"
          + ip_rules                      = (sensitive value)
          + public_network_access_enabled = true
          + trusted_services_allowed      = true
        }
    }

  # module.vnet.azurerm_subnet.vnet["application_gateway"] will be created
  + resource "azurerm_subnet" "vnet" {
      + address_prefixes                              = [
          + "10.202.5.0/25",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "application_gateway"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rgauth001at22"
      + virtual_network_name                          = "vnetauth001at22"
    }

  # module.vnet.azurerm_subnet.vnet["container_apps"] will be created
  + resource "azurerm_subnet" "vnet" {
      + address_prefixes                              = [
          + "10.202.2.0/23",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "container_apps"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rgauth001at22"
      + service_endpoints                             = [
          + "Microsoft.KeyVault",
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "vnetauth001at22"

      + delegation {
          + name = "ca"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.App/environments"
            }
        }
    }

  # module.vnet.azurerm_subnet.vnet["default"] will be created
  + resource "azurerm_subnet" "vnet" {
      + address_prefixes                              = [
          + "10.202.0.0/23",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "default"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rgauth001at22"
      + virtual_network_name                          = "vnetauth001at22"
    }

  # module.vnet.azurerm_subnet.vnet["postgres"] will be created
  + resource "azurerm_subnet" "vnet" {
      + address_prefixes                              = [
          + "10.202.4.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "postgres"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rgauth001at22"
      + service_endpoints                             = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "vnetauth001at22"

      + delegation {
          + name = "fs"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # module.vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.202.0.0/20",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "vnetauth001at22"
      + resource_group_name = "rgauth001at22"
      + subnet              = (known after apply)
    }

Plan: 49 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `push` |
| Working Directory | `infra/deploy/auth` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/at22/auth.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_at22_auth.tfstate.tfplan`